# EA_DataAccCompDel

## Description
Deletes all object components.

```pascal
PROCEDURE EA_DataAccCompDel(acc : INTEGER);
```

```python
def vs.EA_DataAccCompDel(acc):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|acc|INTEGER|   |

## Examples
```pascal
EA_DataAccCompDel(1);
```
```python
import vs

# Deletes all object components.
acc = 1

vs.EA_DataAccCompDel(acc)
```

## Version
Availability: from Vectorworks 2016

## Category
* EnergyAnalysis Interface Library